{
  "target": {
    "type": "stdout"
  },
  "emitters": [
    {
      "name": "example_record_1",
      "dimensions": [
        {
          "type": "enum",
          "name": "quote",
          "values": [
            "Human beings, who are almost unique in having the ability to learn from the experience of others, are also remarkable for their apparent disinclination to do so.",
            "Space is big. You just won't believe how vastly, hugely, mind-bogglingly big it is. I mean, you may think it's a long way down the road to the drug store, but that's just peanuts to space.",
            "Isn't it enough to see that a garden is beautiful without having to believe that there are fairies at the bottom of it too?",
            "Flying is learning how to throw yourself at the ground and miss.",
            "In those days spirits were brave, the stakes were high, men were real men, women were real women and small furry creatures from Alpha Centauri were real small furry creatures from Alpha Centauri.",
            "It is a well-known fact that those people who must want to rule people are, ipso facto, those least suited to do it... anyone who is capable of getting themselves made President should on no account be allowed to do the job.",
            "If it looks like a duck, and quacks like a duck, we have at least to consider the possibility that we have a small aquatic bird of the family anatidae on our hands.",
            "As a child, I was an active Christian. I used to love the school choir and remember the carol service as always such an emotional thing.",
            "In the beginning the Universe was created. This has made a lot of people very angry and been widely regarded as a bad move.",
            "Life is wasted on the living.",
            "Arthur felt happy. He was terribly pleased that the day was for once working out so much according to plan. Only twenty minutes ago he had decided he would go mad, and now here he was already chasing a Chesterfield sofa across the fields of prehistoric Earth.",
            "He hoped and prayed that there wasn't an afterlife. Then he realized there was a contradiction involved here and merely hoped that there wasn't an afterlife.",
            "The Ultimate Answer to Life, The Universe and Everything is...42!",
            "I find the difference, for me, between having no money and having quite a bit is that the bills get bigger. And that's it. The lifestyle doesn't change.",
            "After ten years of word processing, I can't even do hand writing anymore.",
            "Beethoven tells you what it's like to be Beethoven and Mozart tells you what it's like to be human. Bach tells you what it's like to be the universe.\"",
            "Any man who can hitch the length and breadth of the galaxy, rough it, slum it, struggle against terrible odds, win through, and still knows where his towel is is clearly a man to be reckoned with.",
            "Anyone who is capable of getting themselves made President should on no account be allowed to do the job.",
            "I have rooms full of little dongly things and don't want any more. Half the little dongly things I've got, I don't even know what gizmo they're for. More importantly, half the gizmos I've got, I don't know where their little dongly thing is.",
            "You come to me for advice, but you can't cope with anything you don't recognize. Hmmm. So we'll have to tell you something you already know but make it sound like news, eh Well, business as usual , I suppose.",
            "The knack of flying is learning how to throw yourself at the ground and miss.",
            "Beauty doesn't have to be about anything. What's a vase about? What's a sunset or a flower about? What, for that matter, is Mozart's Twenty-third Piano Concerto about?\"",
            "We have normality. I repeat, we have normality. Anything you still can't cope with is therefore your own problem.",
            "In the center lay the exploded carcass of a lonely sperm whale that hadn't lived long enough to be disappointed with its lot.",
            "Well, no, not married as such, but yes, there is a specific girl that I'm not married to.",
            "The storm had now definitely abated, and what thunder there was now grumbled over more distant hills, like a man saying 'And another thing...' twenty minutes after admitting he'd lost the argument.",
            "It can hardly be a coincidence that no language on earth has ever produced the expression, 'As pretty as an airport.",
            "Douglas Adams did not enjoy writing, and he enjoyed it less as time went on. He was a bestselling, acclaimed, and much-loved novelist who had not set out to be a novelist, and who took little joy in the process of crafting novels. He loved talking to audiences. He liked writing screenplays. He liked being at the cutting edge of technology and inventing",
            "I was created to fulfill a function and I failed in it. I negated my own existence.\"",
            "When you walk through the storm, hold your head highAnd don't be afraid of the dark!At the end of the storm is a golden skyAnd the sweet song of the lark.Walk on through the windWalk on through the rainThough your dreams be tossed & blownWalk on, walk on, with hope in your heartAnd you'll never walk alone!\"",
            "My absolute favourite piece of information is the fact that young sloths are so inept that they frequently grab their own arms and legs instead of tree limbs, and fall out of trees.",
            "The bowler approached the wicket at a lope, a trot, and then a run. He suddenly exploded in a flurry of arms and legs, out of which flew a ball.",
            "Arthur blinked at the screens and felt he was missing something important. Suddenly he realized what it was. \"Is there any tea on this spaceship?\" he asked.",
            "Marvin trudged on down the corridor, still moaning. \"...and then of course I've got this terrible pain in all the diodes down my left hand side...\" \"No?\" said Arthur grimly as he walked along beside him. \"Really?\" \"Oh yes,\" said Marvin, \"I mean I've asked for them to be replaced but no one ever listens.\" \"I can imagine.",
            "Time is the worst place, so to speak, to get lost in, as Arthur Dent could testify, having been lost in both time and space a good deal. At least being lost in space kept you busy.",
            "Arthur Dent: What happens if I press this button? Ford Prefect: I wouldn't- Arthur Dent: Oh. Ford Prefect: What happened? Arthur Dent: A sign lit up, saying 'Please do not press this button again.",
            "The only person for whom the house was in any way special was Arthur Dent, and that was only because it happened to be the one he lived in.",
            "You know,\" said Arthur, \"it's at times like this, when I'm trapped in a Vogon airlock with a man from Betelgeuse, and about to die of asphyxiation in deep space that I really wish I'd listened to what my mother told me when I was young.\" \"Why, what did she tell you?\" \"I don't know, I didn't listen.",
            "...they discovered only a small asteroid inhabited by a solitary old man who claimed repeatedly that nothing was true, though he was later discovered to be lying.",
            "Alone of all the races on earth, they seem to be free from the 'Grass is Greener on the other side of the fence' syndrome, and roundly proclaim that Australia is, in fact, the other side of that fence.",
            "There are some people you like immediately, some whom you think you might learn to like in the fullness of time, and some that you simply want to push away from you with a sharp stick.",
            "\"I refuse to prove that I exist\" says God, \"for proof denies faith, and without faith, I am nothing.\" \"Oh,\" says man, \"but the Babel Fish is a dead give-away, isn't it? It proves You exist, and so therefore You don't. Q.E.D.\" \"Oh, I hadn't thought of that,\" says God, who promptly vanishes in a puff of logic.",
            "Meanwhile, the poor Babel fish, by effectively removing all barriers to communication between different races and cultures, has caused more and bloodier wars than anything else in the history of creation.",
            "If you stick a Babel fish in your ear you can instantly understand anything said to you in any form of language.",
            "A beach house isn't just real estate. It's a state of mind.",
            "What's so unpleasant about being drunk?\" \"Ask a glass of water!",
            "There was one planet off in the seventh dimension that got used as a ball in a game of intergalactic bar billiards. Got potted straight into a black hole.",
            "There is a theory which states that if ever anyone discovers exactly what the Universe is for and why it is here, it will instantly disappear and be replaced by something even more bizarre and inexplicable.There is another theory which states that this has already happened.",
            "We notice things that don't work. We don't notice things that do. We notice computers, we don't notice pennies. We notice e-book readers, we don't notice books.",
            "Really, the moment you have any idea, the second thought that enters your mind after the original idea is, \"What is this? Is it a book, is it a movie, is it a this, is it a that, is it a short story, is it a breakfast cereal?\" Really, from that moment, your decision about what kind of thing it is then determines how it develops.",
            "Listen, three eyes,\" he said, \"don't you try to outweird me, I get stranger things than you free with my breakfast cereal.",
            "So you can imagine what happens when a mainland species gets introduced to an island. It would be like introducing Al Capone, Genghis Khan and Rupert Murdoch into the Isle of Wight - the locals wouldn't stand a chance.",
            "Their minds sang with the ecstatic knowledge that either what they were doing was completely and utterly and totally impossible or that physics had a lot of catching up to do.",
            "The problem is, or rather one of the problems, for there are many, a sizeable proportion of which are continually clogging up the civil, commercial, and criminal courts in all areas of the Galaxy, and especially, where possible, the more corrupt ones, this. The previous sentence makes sense. That is not the problem. This is: Change. Read it through again and you'll get it.",
            "... The truth of the matter is, that most English people don't know how to make tea anymore either, and most people drink cheap instant coffee instead, which is a pity, and gives Americans the impression that the English are just generally clueless about hot stimulants.",
            "There is a piece of me that likes to fondly imagine my maverick and rebellious nature, but, more accurately, I like to have a nice and cosy institution that I can rub up against a little bit.",
            "The fact that we live at the bottom of a deep gravity well, on the surface of a gas covered planet going around a nuclear fireball 90 million miles away and think this to be normal is obviously some indication of how skewed our perspective tends to be.",
            "Nobody got murdered before lunch. But nobody. People weren't up to it. You needed a good lunch to get both the blood-sugar and blood-lust levels up.",
            "The mere thought hadn't even begun to speculate about the merest possibility of crossing my mind.",
            "A cup of tea would restore my normality.",
            "Cyberspace is - or can be - a good, friendly and egalitarian place to meet.",
            "I love deadlines. I like the whooshing sound they make as they fly by.",
            "My doctor says that I have a malformed public-duty gland and a natural deficiency in moral fibre and that I am therefore excused from saving universes.",
            "A common mistake that people make when trying to design something completely foolproof is to underestimate the ingenuity of complete fools.",
            "I seldom end up where I wanted to go, but almost always end up where I need to be.",
            "How can I tell,\" said the man, \"that the past isn't a fiction designed to account for the discrepancy between my immediate physical sensations and my state of mind?",
            "The Electric Monk was a labour-saving device, like a dishwasher or a video recorder... Electric Monks believed things for you, thus saving you what was becoming an increasingly onerous task, that of believing all the things the world expected you to believe.",
            "What does it matter? Science has achieved some wonderful things, of course, but I'd far rather be happy than right any day.",
            "Life! Don't talk to me about life!",
            "He was a dreamer, a thinker, a speculative philosopher... or, as his wife would have it, an idiot.",
            "We are not an endangered species ourselves yet, but this is not for lack of trying.",
            "One of the things Ford Prefect had always found hardest to understand about humans was their habit of continually stating and repeating the very very obvious.",
            "Life... is like a grapefruit. Well, it's sort of orangey-yellow and dimpled on the outside, wet and squidgy in the middle. It's got pips inside, too. Oh, and some people have half a one for breakfast.",
            "Goosnargh,\" said Ford Prefect, which was a special Betelgeusian word he used when he knew he should say something but didn't know what it should be.",
            "Six pints of bitter, said Ford Prefect. And quickly please, the world's about to end.",
            "Ford Prefect suppressed a little giggle of evil satisfaction, realized that he had no reason to suppress it, and laughed out loud, a wicked laugh.",
            "Will you stop counting!' snarled Zaphod. 'Yes,' said Ford Prefect, 'in three minutes and thirty-five seconds.",
            "And all dared to brave unknown terrors, to do mighty deeds, to boldly split infinitives that no man had split before--and thus was the Empire forged.",
            "Humans are not proud of their ancestors, and rarely invite them round to dinner.",
            "Life... is like a grapefruit. It's orange and squishy, and has a few pips in it, and some folks have half a one for breakfast.",
            "I'm spending a year dead for tax reasons.",
            "He attacked everything in life with a mix of extraordinary genius and naive incompetence, and it was often difficult to tell which was which.",
            "Any man who can hitch the length and breadth of the galaxy, rough it, slum it, struggle against terrible odds, win through, and still know where his towel is is clearly a man to be reckoned with.",
            "Far out in the uncharted backwaters of the unfashionable end of the western spiral arm of the Galaxy lies a small unregarded yellow pizza.",
            "Far out in the uncharted backwaters of the unfashionable end of the western spiral arm of the Galaxy lies a small unregarded yellow sun. Orbiting this at a distance of roughly ninety-two million miles is an utterly insignificant little blue green planet whose ape-descended life forms are so amazingly primitive that they still think digital watches are a pretty neat idea.",
            "Would it save you a lot of time if I just gave up and went mad now?",
            "I may not have gone where I intended to go, but I think I have ended up where I intended to be.",
            "The Guide is definitive. Reality is frequently inaccurate.",
            "The History of every major Galactic Civilization tends to pass through three distinct and recognizable phases, those of Survival, Inquiry and Sophistication, otherwise known as the How, Why, and Where phases. For instance, the first phase is characterized by the question 'How can we eat?' the second by the question 'Why do we eat?' and the third by the question 'Where shall we have lunch?",
            "God's Final Message to His Creation: 'We apologize for the inconvenience.",
            "The first ten million years were the worst,\" said Marvin, \"and the second ten million years, they were the worst too. The third ten million years I didn't enjoy at all. After that I went into a bit of a decline.",
            "It seemed to me,' said Wonko the Sane, 'that any civilization that had so far lost its head as to need to include a set of detailed instructions for use in a package of toothpicks, was no longer a civilization in which I could live and stay sane.",
            "My universe is my eyes and my ears. Anything else is hearsay.",
            "Simple. I got very bored and depressed, so I went and plugged myself in to its external computer feed. I talked to the computer at great length and explained my view of the Universe to it,\" said Marvin. \"And what happened?\" pressed Ford. \"It committed suicide,\" said Marvin and stalked off back to the Heart of Gold.",
            "The Heart of Gold fled on silently through the night of space, now on conventional photon drive. Its crew of four were ill as ease knowing that they had been brought together not of their own volition or by simple coincidence, but by some curious perversion of physics- as if relationships between people were susceptible to the same laws that governed the relationships between atoms and molecules",
            "If somebody thinks they're a hedgehog, presumably you just give 'em a mirror and a few pictures of hedgehogs and tell them to sort it out for themselves.",
            "It was his subconscious which told him this---that infuriating part of a person's brain which never responds to interrogation, merely gives little meaningful nudges and then sits humming quietly to itself, saying nothing.",
            "So what do we do if we get bitten by something deadly?' I asked. He looked at me as if I were stupid. 'You die, of course. That's what deadly means.",
            "The kakapo is a bird out of time. If you look one in its large, round, greeny-brown face, it has a look of serenely innocent incomprehension that makes you want to hug it and tell it that everything will be all right, thought you know that it probably will not be.",
            "Let's think the unthinkable, let's do the undoable. Let us prepare to grapple with the ineffable itself, and see if we may not eff it after all.",
            "In an infinite Universe anything can happen.",
            "Now the world has gone to bed, Darkness won't engulf my head, I can see by infrared, How I hate the night. Now I lay me down to sleep, Try to count electric sheep, Sweet dream wishes you can keep, How I hate the night. -Marvin",
            "God is no longer an explanation of anything, but has instead become something that would itself need an insurmountable amount of explaining.",
            "To give real service you must add something which cannot be bought or measured with money, and that is sincerity and integrity.",
            "A computer terminal is not some clunky old television with a typewriter in front of it. It is an interface where the mind and body can connect with the universe and move bits of it about.",
            "The simple truth is that interstellar distances will not fit into the human imagination.",
            "The idea that Bill Gates has appeared like a knight in shining armor to lead all customers out of a mire of technological chaos neatly ignores the fact that it was he who, by peddling second-rate technology, led them into it in the first place.",
            "I have terrible periods of lack of confidence. I just don't believe I can do it and no evidence to the contrary will sway me from that view.",
            "I have detected disturbances in the wash.' 'The wash?' 'The space-time wash.' 'Are we talking about some sort of Vogon laundromat, or what are we talking about?' 'Eddies in the space-time continuum.' 'Ah...is he. Is he.' 'What?' 'Er, who is Eddy, then, exactly?",
            "A learning experience is one of those things that says, 'You know that thing you just did? Don't do that.",
            "Why' is the only question that bothers people enough to have an entire letter of the alphabet named after it. The alphabet does not go 'A B C D What? When? How?' but it does go 'V W X Why? Z.",
            "I seem to be having tremendous difficulty with my life-style",
            "People always make this totally artificial distinction between what is commercial and what is good. They quote that maxim \"Nobody ever lost money underestimating the public's taste\" and I think that's very wrongheaded. I like to believe the audience is actually intelligent, because it's made up of other people like yourself.",
            "You live and learn. At any rate, you live.",
            "The teacher usually learns more than the pupils. Isn't that true? \"It would be hard to learn much less than my pupils,\" came a low growl from somewhere on the table, \"without undergoing a pre-frontal lobotomy.\"",
            "Time is an illusion. Lunchtime doubly so.",
            "I wrote an ad for Apple Computer: \"Macintosh - We might not get everything right, but at least we knew the century was going to end\".",
            "Why should I want to make anything up? Life's bad enough as it is without wanting to invent any more of it.",
            "What's up?\" [asked Ford.] I don't know,\" said Marvin, \"I've never been there.",
            "It's part of the shape of the Universe. I only have to talk to somebody and they begin to hate me.",
            "Generally, old media don't die. They just have to grow old gracefully. Guess what, we still have stone masons. They haven't been the primary purveyors of the written word for a while now of course, but they still have a role because you wouldn't want a TV screen on your headstone.",
            "My capacity for happiness,\" he added, \"you could fit into a matchbox without taking out the matches first",
            "It's good to leave your room super-messy when you're away. Whoever tries to break into your room will thought it has already been ransacked.",
            "A mobile phone needs a manual in the way that a teacup doesn't",
            "Every country is like a particular type of person. America is like a belligerent, adolescent boy, Canada is like an intelligent, 35 year old woman. Australia is like Jack Nicholson.",
            "This man is the bee's knees, Arthur, he is the wasp's nipples. He is, I would go so far as to say, the entire set of erogenous zones of every major flying insect of the Western world.",
            "What god would be hanging around Terminal Two of Heathrow Airport trying to catch the 15:37 flight to Oslo?",
            "Dennis Hutch had stepped up into the top seat when its founder had died of a lethal overdose of brick wall, taken while under the influence of a Ferrari and a bottle of tequila.",
            "There are two things you should remember when dealing with parallel universes. One, they're not really parallel, and two, they're not really universes",
            "Ford... you're turning into a penguin. Stop it.",
            "Many words and expressions which only a matter of decades ago were considered so distastefully explicit that, were they merely to be breathed in public, the perpetrator would be shunned, barred from polite society, and in extreme cases shot through the lungs, are now thought to be very healthy and proper, and their use in everyday speech and writing is evidence of a well-adjusted, relaxed and totally un****ed-up personality.",
            "Curiously enough, the only thing that went through the mind of the bowl of petunias as it fell was Oh no, not again. Many people have speculated that if we knew exactly why the bowl of petunias had thought that we would know a lot more about the nature of the Universe than we do now.",
            "It startled him even more when just after he was awarded the Galactic Institute's Prize for Extreme Cleverness he got lynched by a rampaging mob of respectable physicists who had finally realized that the one thing they really couldn't stand was a smart-ass.",
            "Stotting is jumping upward with all four legs simultaneously. My advice: do not die until you've seen a large black poodle stotting in the snow.",
            "Driving a Porsche in London is like bringing a Ming vase to a football game.",
            "It is a mistake to think you can solve any major problems just with potatoes.",
            "Words used carelessly, as if they did not matter in any serious way, often allowed otherwise well-guarded truths to seep through.",
            "We demand rigidly defined areas of doubt and uncertainty!",
            "It can be very dangerous to see things from somebody else's point of view without the proper training.",
            "I don't believe it. Prove it to me and I still won't believe it.",
            "The argument goes something like this: \"I refuse to prove that I exist,\" says God, \"for proof denies faith, and without faith I am nothing.",
            "We can't win against obsession. They care, we don't. They win.",
            "Imagine a puddle waking up one morning and thinking, \" This is an interesting world I find myself in, an interesting hole I find myself in; fits me rather neatly, doesn't it? In fact it fits me staggeringly well! It must have been made to have me in it!",
            "Oh dear,' says God, 'I hadn't thought of that,' and promptly vanishes in a puff of logic.",
            "Can't stand all these poisonous creatures, all these snakes and insects and fish and things. Wretched things, biting everybody. And then people expect me to tell them what to do about it. I'll tell them what to do. Don't get bitten in the first place. (quoting Dr. Struan Sutherland)",
            "He learned to communicate with birds and discovered their conversation was fantastically boring. It was all to do with windspeed, wingspans, power-to-weight ratios and a fair bit about berries.",
            "Very deep. You should send that in to the Reader's Digest. They've got a page for people like you.",
            "I refuse to answer that question on the grounds that I don't know the answer",
            "Science fiction that's just about people wandering around in space ships shooting each other with ray guns is very dull. I like it when it enables you to do fairly radical reinterpretations of human experience, just to show all the different interpretations that can be put on apparently fairly simple and commonplace events. That I find fun.",
            "All opinions are not equal. Some are a very great deal more robust, sophisticated and well supported in logic and argument than others.",
            "One is never alone with a rubber duck.",
            "We demand rigidly defined areas of doubt and uncertainty",
            "I seldom end up where I wanted to go, but almost always end up where I need to be",
            "There is a theory which states that if ever for any reason anyone discovers what exactly the Universe is for and why it is here it will instantly disappear and be replaced by something even more bizarre and inexplicable. There is another that states that this has already happened",
            "How can I tell, said the man, that the past isn't a fiction designed to account for the discrepancy between my immediate physical sensations and my state of mind?",
            "Nobleness was one word for making a fuss about the trivial inevitabilities of life, but there were others.",
            "It's unpleasantly like being drunk.\" \"What's so unpleasant about being drunk?\" \"You ask a glass of water.",
            "As soon as Mr. Prosser realized that he was substantially the loser after all, it was as if a weight lifted itself off his shoulders: this was more like the world as he knew it.",
            "The Hitchhiker's Guide to the Galaxy skips lightly over academic abstraction, pausing only to note that the term \"future perfect\" has been abandoned since it was discovered not to be.",
            "A fragrant breeze wandered up from the quiet sea, trailed along the beach, and drifted back to the sea again, wondering where to go next. On a mad impulse it went up to the beach again. It drifted back to sea.",
            "After five seconds there was a click, and the entire Universe was there in the box with him.",
            "You're a jerk,' repeated the alien, 'a complete asshole.",
            "He was following the Earth through its days, drifting with the rhythms of its myriad pulses, seeping through the webs of its life, swelling with its tides, turning with its weight.",
            "Beethoven tells you what it's like to be Beethoven and Mozart tells you what it's like to be human. Bach tells you what it's like to be the universe.",
            "All you really need to know for the moment is that the universe is a lot more complicated than you might think, even if you start from a position of thinking it's pretty damn complicated in the first place.",
            "He stood up straight and looked the world squarely in the fields and hills. To add weight to his words he stuck the rabbit bone in his hair. He spread his arm out wide. \"I will go mad!\" he annouced.",
            "In an infinite Universe anything can happen,\" said Ford, \"Even survival. Strange but true.",
            "and then I decided I was a lemon for a couple of weeks.",
            "Same as you, Arthur. I hitched a ride. After all, with a degree in maths and another in astrophysics it was either that or back to the dole queue on Monday. Sorry I missed the Wednesday lunch date, but I was in a black hole all morning.",
            "If there's anything more important than my ego around, I want it caught and shot now.",
            "When I was young I used to have this nightmare about dying. I used to lie awake at night screaming. All my schoolfriends went to heaven or hell, and I was sent to Southend.",
            "Rather than arriving five hours late and flustered, it would be better all around if he were to arrive five hours and a few extra minutes late, but triumphantly in command.",
            "He suddenly exploded in a flurry of arms and legs, out of which flew a ball.",
            "He felt a spasm of excitement because he knew instinctively who it was, or at least knew who it was he wanted it to be, and once you know what it is you want to be true, instinct is a very useful device for enabling you to know that it is.",
            "The main reception foyer was almost empty but Ford nevertheless weaved his way through it.",
            "People who need to bully you are the easiest to push around.",
            "A life that is burdened with expectations is a heavy life. Its fruit is sorrow and disappointment.",
            "There's always a moment when you start to fall out of love, whether it's with a person or an idea or a cause, even if it's one you only narrate to yourself years after the event: a tiny thing, a wrong word, a false note, which means that things can never be quite the same again.",
            "The only thing nicer than a phone that didn't ring all the time (or indeed at all) was six phones that didn't ring all the time (or indeed at all).",
            "I'd far rather be happy than right any day.",
            "And then, just when you think that you have experienced all the wonders that this world has to offer, you round a peak and suddenly think you're doing the whole thing over again, but this time on drugs.",
            "Fiordland, a vast tract of mountainous terrain that occupies the south-west corner of South Island, New Zealand, is one of the most astounding pieces of land anywhere on God's earth, and one's first impulse, standing on a cliff top surveying it all, is simply to burst into spontaneous applause.",
            "Mark Knopfler has an extraordinary ability to make a Schecter Custom Stratocaster hoot and sing like angels on a Saturday night, exhausted from being good all week and needing a stiff drink.",
            "I vaguely remember my schooldays. They were what was going on in the background while I was trying to listen to the Beatles.",
            "It was one of those pictures that children are supposed to like but don't. Full of endearing little animals doing endearing things, you know~?",
            "Unfortunately this Electric Monk had developed a fault, and had started to believe all kinds of things, more or less at random. It was even beginning to believe things they'd have difficulty believing in Salt Lake City.",
            "Having not said anything the first time, it was somehow even more difficult to broach the subject the second time around.",
            "The seat received him in a loose and distant kind of way, like an aunt who disapproves of the last fifteen years of your life and will therefore furnish you with a basic sherry, but refuses to catch your eye.",
            "The ships hung in the sky in much the same way that bricks don't.",
            "It all sounds rather naive and sentimental to be talking about children laughing and dancing and singing together when we all know perfectly well that what children do in real life is snarl and take drugs.",
            "You ARE Zaphod Beeblebrox?' 'Yeah,' said Zaphod, 'but don't shout it out or they'll all want one.' 'THE Zaphod Beeblebrox?' 'No, just A Zaphod Beeblebrox, didn't you hear I come in six packs?' 'But sir,' it squealed, 'I just heard on the sub-ether radio report. It said you were dead...' 'Yeah, that's right, I just haven't stopped moving yet.",
            "Nothing travels faster than the speed of light, with the possible exception of bad news, which obeys its own special laws.",
            "Humans think they are smarter than dolphins because we build cars and buildings and start wars etc., and all that dolphins do is swim in the water, eat fish and play around. Dolphins believe that they are smarter for exactly the same reasons.",
            "Please relax,\" said the voice pleasantly, like a stewardess in an airliner with only one wing and two engines one of which is on fire, \"you are perfectly safe.",
            "The air was stifling, but he liked it because it was stifling city air, full of excitingly unpleasant smells, dangerous music, and the distant sound of warring police tribes.",
            "It {Darwin's theory of evolution] was a concept of such stunning simplicity, but it gave rise, naturally, to all of the infinite and baffling complexity of life. The awe it inspired in me made the awe that people talk about in respect of religious experience seem, frankly, silly beside it. I'd take the awe of understanding over the awe of ignorance any day.",
            "Why?' is always the most difficult question to answer. You know where you are when someone asks you 'What's the time?' or 'When was the battle of 1066?' or 'How do these seatbelts work that go tight when you slam the brakes on, Daddy?' The answers are easy and are, respectively, 'Seven-thirty in the evening,' 'Ten-fifteen in the morning,' and 'Don't ask stupid questions.",
            "One of the problems of taking things apart and seeing how they work - supposing you're trying to find out how a cat works--you take that cat apart to see how it works, what you've got in your hands is a non-working cat. The cat wasn't a sort of clunky mechanism that was susceptible to our available tools of analysis.",
            "Don't spin your wheels and stress. Take a deep breath, center yourself and make a plan.",
            "On the delivery plate of the Nutri-Matic Drink Synthesizer was a small tray, on which say three bone china cups and saucers, a bone china jug of milk, a silver teapot full of the best tea Arthur had ever tasted and a small printed note saying \"Wait.",
            "When you walk through the storm, hold your head high And don't be afraid of the dark! At the end of the storm is a golden sky And the sweet song of the lark. Walk on through the wind Walk on through the rain Though your dreams be tossed & blown Walk on, walk on, with hope in your heart And you'll never walk alone!",
            "This must be Thursday. I never could get the hang of Thursdays.",
            "Time travel, by its very nature, was invented in all periods of history simultaneously.",
            "Perhaps I'm old and tired, but I always think that the chances of finding out what really is going on are so absurdly remote that the only thing to do is to say hang the sense of it and just keep yourself occupied.",
            "I'm so great even I get tongue-tied talking to myself.",
            "The Macintosh may only have 10% of the market, but it is clearly the top 10%.",
            "The bird that would soar above the plain of tradition and prejudice must have strong wings.",
            "The major difference between a thing that might go wrong and a thing that cannot possibly go wrong is that when a thing that cannot possibly go wrong goes wrong it usually turns out to be impossible to get at and repair.",
            "You can tune a guitar, but you can't tuna fish. Unless of course, you play bass.",
            "In the old days, writers used to sit in front of a typewriter and stare out of the window. Nowadays, because of the marvels of convergent technology, the thing you type on and the window you stare out of are now the same thing.",
            "Ah, this is obviously some strange usage of the word 'safe' that I wasn't previously aware of.",
            "I think you ought to know I'm feeling very depressed.",
            "It is a rare mind indeed that can render the hitherto non-existent blindingly obvious. The cry 'I could have thought of that' is a very popular and misleading one, for the fact is that they didn't, and a very significant and revealing fact it is too.",
            "Nobody likes a whistler, particularly not the divinity that shapes our ends.",
            "The last ever dolphin message was misinterpreted as a surprisingly sophisticated attempt to do a double-backwards-somersault through a hoop whilst whistling the 'Star Spangled Banner', but in fact the message was this: So long and thanks for all the fish.",
            "As a result of all this hardship, dirt, thirst, and wombats, you would expect Australians to be a dour lot. Instead, they are genial, jolly, cheerful, and always willing to share a kind word with a stranger, unless they are an American.",
            "I'm up to here with cool, okay? I am so amazingly cool you could keep a side of meat in me for a month. I am so hip I have difficulty seeing over my pelvis.",
            "The little waiter's eyebrows wandered about his forehead in confusion.",
            "Zaphod Beeblebrox, adventurer, ex-hippie, good-timer (crook? quite possibly), manic self-publicist, terrible bad at personal relationships, often thought to be completely out to lunch.",
            "Much to his annoyance, a thought popped into his mind. It was very clear and very distinct, and he had now come to recognize these thoughts for what they were. His instinct was to resist them.",
            "What is this? Some sort of galactic hyperhearse?",
            "No one really knows what mattresses are meant to gain from their lives either. They are large, friendly, pocket-sprung creatures that live quiet private lives in the marshes of Sqornshellous Zeta. Many of them get caught, slaughtered, dried out, shipped out and slept on. None of them seems to mind this and all of them are called Zem.",
            "Mark Carwardine's role, essentially, was to be the one who knew what he was talking about. My role, and one for which I was entirely qualified, was to be an extremely ignorant non-zoologist to whom everything that happened would come as a complete surprise.",
            "Every country is like a particular type of person. America is like a belligerent, adolescent boy; Canada is like an intelligent, 35-year-old woman. Australia is like Jack Nicholson. It comes right up to you and laughs very hard in your face in a highly threatening and engaging manner.",
            "Time is bunk.",
            "If you try and take a cat apart to see how it works, the first thing you have on your hands is a nonworking cat.",
            "We no longer think of chairs as technology; we just think of them as chairs. But there was a time when we hadn't worked out how many legs chairs should have, how tall they should be, and they would often 'crash' when we tried to use them.",
            "To be frank, it sometimes seems that the American idea of freedom has more to do with my freedom to do what I want than your freedom to do what you want. I think that, in Europe, we're probably better at understanding how to balance those competing claims, though not a lot.",
            "The impossible often has a kind of integrity which the merely improbable lacks.",
            "There is a piece of me that likes to fondly imagine my maverick and rebellious nature. But, more accurately, I like to have a nice and cosy institution that I can rub up against a little bit.",
            "I taught myself to play the guitar by listening to Paul Simon records, working it out note by note. He is an incredibly intelligent musician. He's not someone who has a natural outpouring of melody like McCartney or Dylan, who are just terribly prolific with musical ideas.",
            "The difficulty with this conversation is that it's very different from most of the ones I've had of late. Which, as I explained, have mostly been with trees.",
            "I find the whole business of religion profoundly interesting. But it does mystify me that otherwise intelligent people take it seriously.",
            "For a moment, nothing happened. Then, after a second or so, nothing continued to happen.",
            "Wandering around the web is like living in a world in which every doorway is actually one of those science fiction devices which deposit you in a completely different part of the world when you walk through them. In fact, it isn't like it, it is it.",
            "Of course you can't 'trust' what people tell you on the web anymore than you can 'trust' what people tell you on megaphones, postcards or in restaurants. Working out the social politics of who you can trust and why is, quite literally, what a very large part of our brain has evolved to do.",
            "I think that growing up in a crowded continent like Europe with an awful lot of competing claims, ideas... cultures... and systems of thought, we have, perforce, developed a more sophisticated notion of what the word 'freedom' means than I see much evidence of in America.",
            "Hundreds of people who've never written before send in 'Dr. Who' scripts. They may have good ideas, but what they fail to realise is that writing for TV is incredibly complicated. They have no idea how difficult it is and what the financial commitment is.",
            "I was the only kid who anybody I knew has ever seen actually walk into a lamppost with his eyes wide open. Everybody assumed that there must be something going on inside, because there sure as hell wasn't anything going on on the outside!",
            "I briefly did therapy, but after a while, I realised it is just like a farmer complaining about the weather. You can't fix the weather - you just have to get on with it.",
            "I remember very little about writing the first series of 'Hitchhiker's.' It's almost as if someone else wrote it.",
            "For instance, on the planet Earth, man had always assumed that he was more intelligent than dolphins because he had achieved so much—the wheel, New York, wars and so on—whilst all the dolphins had ever done was muck about in the water having a good time. But conversely, the dolphins had always believed that they were far more intelligent than man—for precisely the same reasons.",
            "If you really want to understand something, the best way is to try and explain it to someone else.",
            "Don't you understand that we need to be childish in order to understand? Only a child sees things with perfect clarity, because it hasn't developed all those filters which prevent us from seeing things that we don't expect to see.",
            "If you try and take a cat apart to see how it works, the first thing you have on your hands is a non-working cat.",
            "Everything you see or hear or experience in any way at all is specific to you. You create a universe by perceiving it, so everything in the universe you perceive is specific to you.",
            "I'd take the awe of understanding over the awe of ignorance any day.",
            "The quality of any advice anybody has to offer has to be judged against the quality of life they actually lead.",
            "Believe me, it is a great deal better to find cast-iron proof that you're innocent than to languish in a cell hoping that the police---who already think you're guilty---will find it for you.",
            "There is an art to the business of making sandwiches which it is given to few ever to find the time to explore in depth. It is a simple task, but the opportunities for satisfaction are many and profound.",
            "The available worlds looked pretty grim. They had little to offer him because he had little to offer them. He had been extremely chastened to realize that although he originally came from a world which had cars and computers and ballet and Armagnac, he didn't, by himself, know how any of it worked. He couldn't do it. Left to his own devices he couldn't build a toaster. He could just about make a sandwich and that was it.",
            "[The kakapo] is an extremely fat bird. A good-sized adult will weigh about six or seven pounds, and its wings are just about good for waggling a bit if it thinks it's about to trip over something — but flying is out of the question. Sadly, however, it seems that not only has the kakapo forgotten how to fly, but it has forgotten that it has forgotten how to fly. Apparently a seriously worried kakapo will sometimes run up a tree and jump out of it, whereupon it flies like a brick and lands in a graceless heap on the ground.",
            "Yes it is,' said the Professor. 'Wait—' he motioned to Richard, who was about to go out again and investigate— 'let it be. It won't be long.' Richard stared in disbelief. 'You say there's a horse in your bathroom, and all you can do is stand there naming Beatles songs?' The Professor looked blankly at him.",
            "Your God person puts an apple tree in the middle of a garden and says, do what you like, guys, oh, but don't eat the apple. Surprise surprise, they eat it and he leaps out from behind a bush shouting \"Gotcha\". It wouldn't have made any difference if they hadn't eaten it.' 'Why not?' 'Because if you're dealing with somebody who has the sort of mentality which likes leaving hats on the pavement with bricks under them you know perfectly well they won't give up. They'll get you in the end.",
            "There is no point in using the word 'impossible' to describe something that has clearly happened.",
            "It is folly to say you know what is happening to other people. Only they know, if they exist. They have their own Universes of their own eyes and ears.",
            "This planet has — or rather had — a problem, which was this: most of the people living on it were unhappy for pretty much all of the time.",
            "This planet has - or rather had - a problem, which was this: most of the people living on it were unhappy for pretty much of the time. Many solutions were suggested for this problem, but most of these were largely concerned with the movement of small green pieces of paper, which was odd because on the whole it wasn't the small green pieces of paper that were unhappy.",
            "Don't believe anything you read on the net. Except this. Well, including this, I suppose.",
            "Everybody has their moment of great opportunity in life. If you happen to miss the one you care about, then everything else becomes eerily easy.",
            "She had what it took: great hair, a profound understanding of strategic lip gloss, the intelligence to understand the world and a tiny secret interior deadness which meant she didn’t care.",
            "The great thing about being the only species that makes a distinction between right and wrong is that we can make up the rules for ourselves as we go along.",
            "He had a tremendous propensity for getting lost when driving. This was largely because of his method of “Zen” navigation, which was simply to find any car that looked as if it knew where it was going and follow it. The results were more often surprising than successful, but he felt it was worth it for the sake of the few occasions when it was both.",
            "One of the major problems encountered in time travel is not that of accidentally becoming your own father or mother. There is no problem involved in becoming your own father or mother that a broadminded and well-adjusted family can't cope with.",
            "One of the problems, and it's one which is obviously going to get worse, is that all the people at the party are either the children or the grandchildren or the great-grandchildren of the people who wouldn't leave in the first place, and because of all the business about selective breeding and regressive genes and so on, it means that all the people now at the party are either absolutely fanatical partygoers, or gibbering idiots, or, more and more frequently, both.",
            "The most misleading assumptions are the ones you don't even know you're making.",
            "First we thought the PC was a calculator. Then we found out how to turn numbers into letters with ASCII — and we thought it was a typewriter. Then we discovered graphics, and we thought it was a television. With the World Wide Web, we've realized it's a brochure.",
            "The world is a thing of utter inordinate complexity and richness and strangeness that is absolutely awesome.",
            "I think the problem, to be quite honest with you, is that you've never actually known what the question is.",
            "Yes, I think I use the term radical rather loosely, just for emphasis. If you describe yourself as atheist some people will say, Don't you mean agnostic? I have to reply that I really do mean atheist, I really do not believe that there is a god; in fact, I am convinced that there is not a god (a subtle difference). I see not a shred of evidence to suggest that there is one...etc., etc. It's easier to say that I am a radical atheist, just to signal that I really mean it, have thought about it a great deal and that it's an opinion I hold seriously.",
            "The hardest assumption to challenge is the one you don't even know you are making.",
            "42 is a nice number that you can take home and introduce to your family.",
            "Assumptions are what we don't know we are making",
            "It is difficult to be sat on all day, every day, by some other creature, without forming an opinion on them. On the other hand, it is perfectly possible to sit all day, every day, on top of another creature and not have the slightest thought about them whatsoever.",
            "Why are people born? Why do they die? Why do they want to spend so much of the intervening time wearing digital watches?",
            "If you took a couple of David Bowies and stuck one of the David Bowies on the top of the other David Bowie, then attached another David Bowie to the end of each of the arms of the upper of the first two David Bowies and wrapped the whole business up in a dirty beach robe you would then have something which didn't exactly look like John Watson, but which those who knew him would find hauntingly familiar.",
            "If life is going to exist in a Universe of this size, then the one thing it cannot afford to have is a sense of proportion.",
            "There was a point to this story, but it has temporarily escaped the chronicler's mind.",
            "Lovers of print are simply confusing the plate for the food.",
            "We are stuck with technology when what we really want is just stuff that works.",
            "And as he drove on, the rainclouds dragged down the sky after him, for, though he did not know it, Rob McKenna was a Rain God. All he knew was that his working days were miserable and he had a succession of lousy holidays. All the clouds knew was that they loved him and wanted to be near him, to cherish him, and to water him.",
            "Bistromathics itself is simply a revolutionary new way of understanding the behavior of numbers. Just as Einstein observed that space was not an absolute but depended on the observer's movement in space, and that time was not an absolute, but depended on the observer's movement in time, so it is now realized that numbers are not absolute, but depend on the observer's movement in restaurants.",
            "The idea was fantastically, wildly improbable. But like most fantastically, wildly improbable ideas it was at least as worthy of consideration as a more mundane one to which the facts had been strenuously bent to fit.",
            "Solutions nearly always come from the direction you least expect, which means there's no point trying to look in that direction because it won't be coming from there.",
            "Bypasses are devices that allow some people to dash from point A to point B very fast while other people dash from point B to point A very fast. People living at point C, being a point directly in between, are often given to wonder what's so great about point A that so many people from point B are so keen to get there and what's so great about point B that so many people from point A are so keen to get there. They often wish that people would just once and for all work out where the hell they wanted to be.",
            "What I mean is that if you really want to understand something, the best way is to try and explain it to someone else. That forces you to sort it out in your own mind. And the more slow and dim-witted your pupil, the more you have to break things down into more and more simple ideas. And that’s really the essence of programming. By the time you’ve sorted out a complicated idea into little steps that even a stupid machine can deal with, you’ve certainly learned something about it yourself. The teacher usually learns more than the pupil. Isn’t that true?",
            "Anything that thinks logically can be fooled by something else that thinks at least as logically as it does.",
            "But the reason I call myself by my childhood name is to remind myself that a scientist must also be absolutely like a child. If he sees a thing, he must say that he sees it, whether it was what he thought he was going to see or not. See first, think later, then test. But always see first. Otherwise you will only see what you were expecting.",
            "I find that writing is a constant battle with exactly the same problems you've always had.",
            "In order to fly, all one must do is simply miss the ground.",
            "Technology is a word that describes something that doesn't work yet.",
            "We are now cruising at a level of two to the power of twenty-five thousand to one against and falling, and we will be restoring normality just as soon as we are sure what is normal anyway.",
            "You may not instantly see why I bring the subject up, but that is because my mind works so phenomenally fast, and I am at a rough estimate thirty billion times more intelligent than you. Let me give you an example. Think of a number, any number.” “Er, five,” said the mattress. “Wrong,” said Marvin. “You see?",
            "When people you greatly admire appear to be thinking deep thoughts, they probably are thinking about lunch.",
            "and we’ll be saying a big hello to all intelligent life forms everywhere … and to everyone else out there, the secret is to bang the rocks together, guys.",
            "The Hitch-Hiker's Guide to the Galaxy also mentions alcohol. It says that the best drink in existence is the Pan Galactic Gargle Blaster, the effect of which is like having your brains smashed out with a slice of lemon wrapped round a large gold brick.",
            "Did I do anything wrong today,\" he said, \"or has the world always been like this and I've been too wrapped up in myself to notice?",
            "I think fish is nice, but then I think that rain is wet, so who am I to judge?",
            "The Answer to the Great Question... Of Life, the Universe and Everything... Is... Forty-two,' said Deep Thought, with infinite majesty and calm.",
            "So the hours are pretty good then?' he resumed. The Vogon stared down at him as sluggish thoughts moiled around in the murky depths. Yeah,' he said, 'but now you come to mention it, most of the actual minutes are pretty lousy.",
            "One always overcompensates for disabilities. I'm thinking of having my entire body surgically removed.",
            "Was there a reason behind it? There would be no point in asking Zaphod, he never appeared to have a reason for anything he did at all: he had turned unfathomability into an art form. He attacked everything in life with a mixture of extraordinary genius and naive incompetence and it was often difficult to tell which was which.",
            "Even a manically depressed robot is better to talk to than nobody.",
            "Let us be dreamers, thinkers, speculative philosophers, or as our spouses would have it: Idiots",
            "You can't possibly be a scientist if you mind people thinking that you're a fool.",
            "David Attenborough has said that Bali is the most beautiful place in the world, but he must have been there longer than we were, and seen different bits, because most of what we saw in the couple of days we were there sorting out our travel arrangements was awful. It was just the tourist area, i.e., that part of Bali which has been made almost exactly the same as everywhere else in the world for the sake of people who have come all this way to see Bali.",
            "Sherlock Holmes observed that once you have eliminated the impossible then whatever remains, however improbable, must be the answer. I, however, do not like to eliminate the impossible.",
            "The light works,\" he said, indicating the window, \"the gravity works,\" he said, dropping a pencil on the floor. \"Anything else we have to take our chances with.",
            "I don't go to mythical places with strange men.",
            "Life,” said Marvin dolefully, “loathe it or ignore it, you can’t like it.",
            "If we see you smoking we will assume you are on fire and take appropriate action.",
            "Even the evil-looking bird perched on a rod in the bar had stopped screeching out the names and addresses of local contract killers, which was a service it provided for free.",
            "Siamese Cats have a way of staring at you. Those who have walked in on the Queen cleaning her teeth will know the expression.",
            "WOKING (vb.) To enter the kitchen with the precise determination to perform something only to forget what it is just before you do it.",
            "Very strange people, physicists - in my experience the ones who aren't dead are in some way very ill.",
            "I think all cats are wild. They only act tame if there´s a saucer of milk in it for them.",
            "Shee, you guys are so unhip it's a wonder your bums don't fall off.",
            "We all like to congregate at boundary conditions. Where land meets water. Where earth meets air. Where bodies meet mind. Where space meets time. We like to be on one side, and look at the other.",
            "I've come up with a set of rules that describe our reactions to technologies: 1. Anything that is in the world when you’re born is normal and ordinary and is just a natural part of the way the world works. 2. Anything that's invented between when you’re fifteen and thirty-five is new and exciting and revolutionary and you can probably get a career in it. 3. Anything invented after you're thirty-five is against the natural order of things.",
            "Some say that the universe is made so that when we are about to understand it it changes into something even more incomprehensible. And then there are those who say that this has already happened.",
            "From another direction he felt the sensation of being a sheep startled by a flying saucer, but it was virtually indistinguishable from the feeling of being a sheep startled by anything else it ever encountered, for they were creatures who learned very little on their journey through life, and would be startled to see the sun rising in the morning, and astonished by all the green stuff in the fields.",
            "‎If you ever find you need help again, you know, if you're in trouble, need a hand out of a corner...\" \"Yeah?\" \"Please don't hesitate to get lost.",
            "The Encyclopedia Galactica defines a robot as a mechanical apparatus designed to do the work of a man. The marketing division of the Sirius Cybernetics Corporation defines a robot as \"Your Plastic Pal Who's Fun to Be With. The Hitchhiker's Guide to the Galaxy defines the marketing devision of the Sirius Cybernetic Corporation as \"a bunch of mindless jerks who'll be the first against the wall when the revolution comes,",
            "The longest and most destructive party ever held is now into its fourth generation and still no one shows any signs of leaving. Somebody did once look at his watch, but that was eleven years ago now, and there has been no follow up.",
            "He picked up the letter Q and hurled it into a distant privet bush where it hit a young rabbit. The rabbit hurtled off in terror and didn’t stop till it was set upon and eaten by a fox which choked on one of its bones and died on the bank of a stream which subsequently washed it away. During the following weeks Ford Perfect swallowed his pride and struck up a relationship with a girl who had been a personnel officer on Golgafrincham, and he was terribly upset when she suddenly passed away as a result of drinking water from a pool that had been polluted by the body of a dead fox.",
            "If there's any real truth, it's that the entire multidimensional infinity of the Universe is almost certainly being run by a bunch of maniacs.",
            "I come in peace...Take me to your lizard.",
            "He inched his way up the corridor as if he would rather be yarding his way down it, which was true.",
            "Hey, this is terrific!\" he said. \"Someone down there is trying to kill us!\" \"Terrific,\" said Arthur. \"But don't you see what this means?\" \"Yes. We are going to die.\" \"Yes, but apart from that.\" \"Apart from that?!\" \"It means we must be on to something!\" \"How soon can we get off it?",
            "Looking up into the night sky is looking into infinity — distance is incomprehensible and therefore meaningless",
            "In fact, Lig never formally resigned his editorship—he merely left his office late one morning, and has never returned since. Though well over a century has now passed, many members of the Guide staff still retain the romantic notion that he has simply popped out for a sandwich and will yet return to put in a solid afternoon's work. Strictly speaking, all editors since Lig Lury Jr., have therefore been designated acting editors, and Lig's desk is still preserved the way he left it, with the addition of a small sign that says LIG LURY, JR., EDITOR, MISSING, PRESUMED FED.",
            "Please call me Eddie if it will help you to relax.",
            "He was a man who was charged with the work he did in life because he was not one to ask questions - not so much on account of any natural quality of discretion as because he simply could never think of any questions to ask. ... On the strength of which he had guaranteed himself regular employment for as long as he cared to live.",
            "Sir,' I said to the universe, 'I exist.' 'That,' said the universe, 'creates no sense of obligation in me whatsoever.",
            "Marvin was humming ironically because he hated humans so much.",
            "Aberystwyth (n.) A nostalgic yearning which is in itself more pleasant than the thing being yearned for.",
            "Alltami (n.) The ancient art of being able to balance the hot and cold shower taps.",
            "Beppu (n.) The triumphant slamming shut of a book after reading the final page.",
            "Structural linguistics is a bitterly divided and unhappy profession, and a large number of its practitioners spend many nights drowning their sorrows in Ouisghian Zodahs.",
            "You barbarians!' he yelled. 'I'll sue the council for every penny it's got! I'll have you hung, drawn and quartered! And whipped! And boiled...until...until...until...until you've had enough.' Ford was running after him. Very very fast. 'And then I will do it again!' yelled Arthur, 'And when I've finished I will take all the little bits, and I will jump on them!",
            "Well the hours are good...' ... 'but now you come to mention it, most of the actual minutes are pretty lousy.",
            "Fifteen years was a long time to be stranded anywhere, particularly somewhere as mind-boggingly dull as Earth.",
            "Only by counting could humans demonstrate their independence of computers.",
            "What a wonderfully exciting cough,' said the little man, quite startled by it, 'do you mind if I join you?' And with that he launched into the most extraordinary and spectacular fit of coughing which caught Arthur so much by surprise that he started to choke violently, discovered he was already doing it and got thoroughly confused.",
            "They wouldn’t even lift a finger to save their own grandmothers from the Ravenous Bugblatter Beast of Traal without orders signed in triplicate, sent in, sent back, queried, lost, found, subjected to public inquiry, lost again, and finally buried in soft peat for three months and recycled as firelighters.",
            "There’s no point in acting surprised about it. All the planning charts and demolition orders have been on display at your local planning department in Alpha Centauri for 50 of your Earth years, so you’ve had plenty of time to lodge any formal complaint and it’s far too late to start making a fuss about it now. … What do you mean you’ve never been to Alpha Centauri? Oh, for heaven’s sake, mankind, it’s only four light years away, you know. I’m sorry, but if you can’t be bothered to take an interest in local affairs, that’s your own lookout. Energize the demolition beams.",
            "There was a terribly ghastly silence. There was a terribly ghastly noise. There was a terribly ghastly silence.",
            "I've never understood all this fuss people make about the dawn. I've seen a few and they're never as good as the photographs, which have the additional advantage of being things you can look at when you're in the right frame of mind, which is usually around lunchtime.",
            "The Saab seethed off into the night. Arthur watched it go, as stunned as a man might be who, having believed himself to be totally blind for five years, suddenly discovers that he had merely been wearing too large a hat.",
            "I really didn't foresee the Internet. But then, neither did the computer industry. Not that that tells us very much of course--the computer industry didn't even foresee that the century was going to end.",
            "And so the problem remained; lots of people were mean, and most were miserable, even the ones with digital watches.",
            "Mc Donalds he thought. There's no longer any such thing as a Mc Donalds hamburger. He passed out. When he came around seconds later he found he was sobbing for his mother.",
            "He was constantly reminded of how startlingly different a place the world was when viewed from a point only three feet to the left.",
            "We live in strange times. We also live in strange places: each in a universe of our own. The people with whom we populate our universes are the shadows of whole other universes intersecting with our own. Being able to glance out into this bewildering complexity of infinite recursion and say things like, 'Oh, hi, Ed! Nice tan. How's Carol?' involves a great deal of filtering skill for which all conscious entities have eventually to develop a capacity in order to protect themselves from the contemplation of the chaos through which they seethe and tumble.",
            "There are two things in particular that it [the computer industry] failed to foresee: one was the coming of the Internet(...); the other was the fact that the century would end.",
            "Reality is hopelessly inaccurate.",
            "I always thought something was fundamentally wrong with the universe",
            "The world is a thing of utter inordinate complexity and richness and strangeness that is absolutely awesome. I mean the idea that such complexity can arise not only out of such simplicity, but probably absolutely out of nothing, is the most fabulous extraordinary idea. And once you get some kind of inkling of how that might have happened, it's just wonderful. And . . . the opportunity to spend 70 or 80 years of your life in such a universe is time well spent as far as I am concerned.",
            "My favorite piece of information is that Branwell Brontë, brother of Emily and Charlotte, died standing up leaning against a mantelpiece, in order to prove it could be done. This is not quite true, in fact. My absolute favorite piece of information is the fact that young sloths are so inept that they frequently grab their own arms and legs instead of tree limbs, and fall out of trees.",
            "The lights went out in his eyes for absolutely the very last time ever.",
            "The reason why so many sects hang around airports looking for converts: they know that people there are at their most vulnerable and perplexed, and ready to accept any kind of guidance.",
            "Assumptions are the things we don't know we're making.",
            "The difference between us and a computer is that, the computer is blindingly stupid, but it is capable of being stupid many, many million times a second.",
            "In fact, a very similar phrase was invented to account for the sudden transition of wood, metal, plastic and concrete into an explosive condition, which was \"nonlinear, catastrophic structural exasperation,\" or to put it another way--as a junior cabinet minister did on television the following night in a phrase which was to haunt the rest of his career--the check-in desk had just got \"fundamentally fed up with being where it was.",
            "My own strategy is to find a car, or the nearest equivalent, which looks as if it knows where it's going and follow it. I rarely end up where I was intending to go, but often I end up somewhere I needed to be.",
            "The usual people tried to claim responsibility. First the IRA , then the PLO and the Gas Board. Even British Nuclear Fuels rushed out a statement to the effect that the situation was completely under control, that it was a one in a million chance, that there was hardly any radioactive leakage at all, and that the site of the explosion would make a nice location for a day out with the kids and a picnic, before finally having to admit that it wasn't actually anything to do with them at all.",
            "I think a nerd is a person who uses the telephone to talk to other people about telephones. And a computer nerd therefore is somebody who uses a computer in order to use a computer.",
            "Ha, but my life is a box of wormgears.",
            "Would you like me to go and stick my head in a bucket of water?",
            "We no longer think of chairs as technology, we just think of them as chairs. But there was a time when we hadn't worked out how many legs chairs should have, how tall they should be, and they would often \"crash\" when we tried to use them. Before long, computers will be as trivial and plentiful as chairs and we will cease to be aware of the things. In fact I'm sure we will look back on this last decade and wonder how we could ever have mistaken what we were doing with them for \"productivity\"",
            "Presidents don't have power. Their job is to draw attention away from it.",
            "The single raindrop never feels responsible for the flood.",
            "Who should play the lead role in a film about me? Dunno. Danny De Vito? Jeff Goldblum? Meryl Streep? Someone of that kind.",
            "We talked about how easy it was to make the mistake of anthropomorphizing animals, and projecting our own feelings and perceptions on to them, where they were inappropriate and didn't fit. We simply had no idea what it was like being an extremely large lizard, and neither for that matter did the lizard, because it was not self-conscious about being an extremely large lizard, it just got on with the business of being one. To react with revulsion to its behavior was to make the mistake of applying criteria that are only appropriate to the business of being human.",
            "The more I think about our species the more I think we just do stuff and make up explanations later when asked. But it's not true that I would rather write than read. I would rather read than write. To be honest I would rather hang upside down in a bucket than write.",
            "The Hitch Hiker's Guide has not been an opera. It has however been a tapestry, if you count a woven bath towel as a tapestry.",
            "Space is big. You just won't believe how vastly, hugely, mind-bogglingly big it is...",
            "Being virtually killed by a virtual laser in a virtual space is just as effective as the real thing, because you are as dead as you think you are.",
            "We live in strange times. We also live in strange places, each in a universe of our own. The people with whom we populate our universe are the shadows of whole other universes intersecting with our own.",
            "The big corporations are suddenly taking notice of the web, and their reactions have been slow. Even the computer industry failed to see the importance of the Internet, but that's not saying much. Let's face it, the computer industry failed to see that the century would end.",
            "Moving from radio to television, you can take most of the words with you.",
            "There is no problem so complicated that you can't find a very simple answer to it if you look at it right.",
            "You can't dodge your responsibilities by saying they don't exist!",
            "Beauty doesn't have to be about anything. What's a vase about? What's a sunset or a flower about? What, for that matter, is Mozart's Twenty-third Piano Concerto about?",
            "One of the most important things you learn from the internet is that there is no ‘them’ out there. It’s just an awful lot of ‘us’.",
            "He had extracted himself from the Cambridge one-way system by the usual method, which involved going round and round it faster and faster until he achieved a sort of escape velocity and flew off at a tangent in a random direction, which he was now trying to identify and correct for.",
            "I am terribly proud of-I was born in Cambridge in 1952 and my initials are DNA!",
            "A nerd is someone who uses a telephone to talk to other people about telephones.",
            "A hole had just appeared in the Galaxy. It was exactly a nothingth of a second long, a nothingth of an inch wide, and quite a lot of million light years from end to end. As it closed up [...] Two hundred and thirty-nine thousand lightly fried eggs fell out of it...materializing in a large woobly heap on the famine-struck land of Poghril in the Pansel system. The whole Poghril tribe had died out from famine except for one last man who died of cholesterol poisoning some weeks later.",
            "The story goes that I first had the idea for The Hitchiker's Guide to the Galaxy while lying drunk in a field in Innsbruck.",
            "I think media are at their most interesting before anybody's thought of calling them art, when people still think they're just a load of junk.",
            "'Totally mad,' he said, 'utter nonsense. But we'll do it because it's brilliant nonsense.'",
            "I say what it occurs to me to say when I think I hear people say things. More I cannot say.",
            "'These things will become clear to you,' said the old man gently, 'at least,' he added with slight doubt in his voice, 'clearer than they are at the moment.'",
            "In cases of major discrepancy its always reality thats got it wrong ... reality is frequently inaccurate.",
            "The fact is, I don't know where my ideas come from. Nor does any writer. The only real answer is to drink way too much coffee and buy yourself a desk that doesn't collapse when you beat your head against it.",
            "Put away your worries, the world is a good and perfect place. It is in fact very easy.",
            "When the idea comes, I often can't remember where it came from. I remember very little about writing the first series of Hitchhiker's. It's almost as if someone else wrote it.",
            "Most of the time spent wrestling with technologies that don't quite work yet is just not worth it for end users, however much fun it is for nerds.",
            "I am fascinated by religion. (That's a completely different thing from believing in it!) It has had such an incalculably huge effect on human affairs. What is it? What does it represent? Why have we invented it? How does it keep going? What will become of it? I love to keep poking and prodding at it. I've thought about it so much over the years that that fascination is bound to spill over into my writing.",
            "There is another theory that states: This has already happened ....",
            "The last time anybody made a list of the top hundred character attributes of New Yorkers, common sense snuck in at number 79.",
            "SHOEBURYNESS (abs.n.) The vague uncomfortable feeling you get when sitting on a seat which is still warm from somebody else's bottom",
            "It takes an awful lot of time to not write a book.",
            "There is a feeling which persists in England that making a sandwich interesting, attractive, or in any way pleasant to eat is something sinful that only foreigners do.",
            "Time doesn't necessarily happen in chronological order.",
            "Bypasses are devices that allow some people to dash from point A to point B very fast while other people dash from point B to point A very fast.",
            "Space is really big-REALLY big.",
            "The moment at which two people, approaching from opposite ends of a long passageway, recognize each other and immediately pretend they haven t. This is to avoid the ghastly embarrassment of having to continue recognizing each other the whole length of the corridor.",
            "For seven and a half million years, Deep Thought computed and calculated, and in the end announced that the answer was in fact Forty-two - and so another, even bigger, computer had to be built to find out what the actual question was...",
            "How do you know you're having fun if there's no one watching you have it?",
            "In many of the more relaxed civilizations on the Outer Eastern Rim of the Galaxy, the Hitch-Hiker's Guide has already supplanted the great Encyclopaedia Galactica as the standard repository of all knowledge and wisdom, for though it has many omissions and contains much that is apocryphal, or at least wildly inaccurate, it scores over the older, more pedestrian work in two important respects. First, it is slightly cheaper; and secondly it has the words DON'T PANIC inscribed in large friendly letters on its cover.",
            "He sniggered. He didn't like to think of himself as the sort of person who giggled or sniggered, but he had to admit that he had been giggling and sniggering almost continuously for well over half an hour now.",
            "Arthur shook his head and sat down. He looked up. “I thought you must be dead …” he said simply. “So did I for a while,” said Ford, “and then I decided I was a lemon for a couple of weeks. I kept myself amused all that time jumping in and out of a gin and tonic.",
            "In the end, it was the Sunday afternoons he couldn't cope with, and that terrible listlessness which starts to set in at about 2:55, when you know that you've had all the baths you can usefully have that day, that however hard you stare at any given paragraph in the papers you will never actually read it, or use the revolutionary new pruning technique it describes, and that as you stare at the clock the hands will move relentlessly on to four o'clock, and you will enter the long dark teatime of the soul.",
            "[The Head of Radio Three] had been ensnared by the Music Director of the college and a Professor of Philosophy. These two were busy explaining to the harassed man that the phrase \"too much Mozart\" was, given any reasonable definition of those three words, an inherently self-contradictory expression, and that any sentence which contained such a phrase would be thereby rendered meaningless and could not, consequently, be advanced as part of an argument in favour of any given programme-scheduling strategy.",
            "That was it. That was really it. She knew that she had told herself that that was it only seconds earlier, but this was now the final real ulimate it.",
            "Anything that happens, happens. Anything that, in happening, causes something else to happen, causes something else to happen. Anything that, in happening, causes itself to happen again, happens again. It doesn’t necessarily do it in chronological order, though.",
            "When you're cruising down the road in the fast lane and you lazily sail past a few hard-driving cars and are feeling pretty pleased with yourself and then accidently change down from fourth to first instead of third thus making your engine leap out of your hood in a rather ugly mess, it tends to throw you off stride in much the same way that this remark threw Ford Prefect off his.",
            "Ford looked at him severely. And no sneaky knocking down Mr Dent's house whilst he's away, alright?\" he said. The mere thought,\" growled Mr Prosser, \"hadn't even begun to speculate,\" he continued, settling himself back, \"about the merest possibility of crossing my mind.",
            "The technology involved in making anything invisible is so infinitely complex that nine hundred and ninety-nine billion, nine hundred and ninety-nine million, nine hundred and ninety-nine thousand, nine hundred and ninety-nine times out of a trillion it is much simpler and more effective just to take the thing away and do without it.",
            "The more Susan waited, the more the doorbell didn't ring. Or the phone.",
            "We’ll meet the meat.",
            "I only know as much about myself as my mind can work out under its current conditions. And its current conditions are not good.",
            "Mr L Prosser was, as they say, only human. In other words he was a carbon-based life form descended from an ape. More specifically he was forty, fat and shabby and worked for the local council. Curiously enough, though he didn't know it, he was also a direct male-line descendant of Genghis Khan, though intervening generations and racial mixing had so juggled his genes that he had no discernible Mongoloid characteristics, and the only vestiges left in Mr L Prosser of his mighty ancestry were a pronounced stoutness about the tum and a predilection for little fur hats.",
            "Conceited little mega-puppy.",
            "He felt like an old sponge steeped in paraffin and left in the sun to dry.",
            "Ballycumber (ba-li-KUM-ber) n. One of the six half-read books lying somewhere in your bed.",
            "He actually caught himself saying things like \"Yippee,\" as he pranced ridiculously round the house.",
            "He has personality problems beyond the dreams of analysts.",
            "Ghastly,\" continued Marvin, \"it all is. Absolutely ghastly. Just don't even talk about it. Look at this door,\" he said, stepping through it. The irony circuits cut in to his voice modulator as he mimicked the style of the sales brochure. \" 'All the doors in his spaceship have a cheerful and sunny disposition. It is their pleasure to open for you, and their satisfaction to close again with the knowledge of a job well done.' \" As the door closed behind them it became apparent that it did indeed have a satisfied sighlike quality to it. \"Hummmmmmmyummmmmmmah!\" it said.",
            "Marvin started his ironical humming again. Zaphod hit him and he shut up.",
            "The Universe, as has been observed before, is an unsettlingly big place, a fact which for the sake of a quiet life most people tend to ignore.",
            "The only moral it is possible to draw from this story is that one should never throw the Q letter into a privet bush, but unfortunately there are times when it is unavoidable.",
            "Do you find coming to terms with the mindless tedium of it all presents an interesting challenge?",
            "The lights were off so that his heads could avoid looking at each other because neither of them was currently a particular engaging sight, nor had they been since he had made the error of looking into his soul. It had indeed been an error. It had been late one night-- of course. It had been a difficult day-- of course. There had been soulful music playing on the ship's sound system-- of course. And he had, of course, been slightly drunk. In other words, all the usual conditions that bring on a bout of soul searching had applied, but it had, nevertheless, clearly been an error.",
            "Here, for whatever reason, is the world. And here it stays. With me on it.",
            "Gordon Way's astonishment at being suddenly shot dead was nothing compared to his astonishment at what happened next.",
            "You cannot see what I see because you see what you see. You cannot know what I know because you know what you know. What I see and what I know cannot be added to what you see and what you know because they are not of the same kind. Neither can it replace what you see and what you know, because that would be to replace you yourself.\" \"Hang on, can I write this down?\" said Arthur, excitedly fumbling in his pocket for a pencil.",
            "The waiter approached. 'Would you like to see the menu?' he said. 'Or would you like to meet the Dish of the Day?' 'Huh?' said Ford. 'Huh?' said Arthur. 'Huh?' said Trillian. 'That’s cool,' said Zaphod. 'We'll meet the meat.",
            "Yes, it is true that sometimes unusually intelligent and sensitive children can appear to be stupid. But stupid children can sometimes appear to be stupid as well. I think that's something you might have to consider.",
            "I am a private detective. I am paid to be inquisitive and presumptuous.",
            "If everyone knew exactly what I was going to say, then there would be no point in my saying it, would there?",
            "It is worth repeating at this point the theories that Ford had come up with, on his first encounter with human beings, to account for their peculiar habit of continually stating and restating the very very obvious, as in \"It's a nice day,\" or \"You're very tall,\" or \"So this is it, we're going to die.\" His first theory was that if human beings didn't keep exercising their lips, their mouths probably shriveled up. After a few months of observation he had come up with a second theory, which was this--\"If human beings don't keep exercising their lips, their brains start working.",
            "If the Universe came to an end every time there was some uncertainty about what had happened in it, it would never have got beyond the first picosecond. And many of course don't. It's like a human body, you see. A few cuts and bruises here and there don't hurt it. Not even major surgery if it's done properly. Paradoxes are just the scar tissue. Time and space heal themselves up around them and people simply remember a version of events which makes as much sense as they require it to make.",
            "Come on,” he droned, “I’ve been ordered to take you down to the bridge. Here I am, brain the size of a planet and they ask me to take you down to the bridge. Call that job satisfaction? ’Cos I don’t.” He turned and walked back to the hated door. “Er, excuse me,” said Ford following after him, “which government owns this ship?” Marvin ignored him. “You watch this door,” he muttered, “it’s about to open again. I can tell by the intolerable air of smugness it suddenly generates.",
            "The complexities of cause and effect defy analysis.",
            "Not unnaturally, many elevators imbued with intelligence and precognition became terribly frustrated with the mindless business of going up and down, up and down, experimented briefly with the notion of going sideways, as a sort of existential protest, demanded participation in the decision-making process and finally took to squatting in basements sulking. An impoverished hitch-hiker visiting any planets in the Sirius star system these days can pick up easy money working as a counsellor for neurotic elevators.",
            "I teleported home last night with Ron and Sid and Meg Ron stole Meggy's heart away and I got Sidney's leg.",
            "Don't blame you,\" said Marvin and counted five hundred and ninety-seven thousand million sheep before falling asleep again a second later.",
            "To Trin Tragula's horror, the shock completely annihilated her brain; but to his satisfaction he realized that he had proved conclusively that if life is going to exist in a Universe of this size, then the one thing it cannot afford to have is a sense of proportion.",
            "The point is, you see,\" said Ford, \"that there is no point in driving yourself mad trying to stop yourself going mad. You might just as well give in and save your sanity for later.",
            "But what about the End of the Universe? We'll miss the big moment.\" I've seen it. It's rubbish,\" said Zaphod,\"nothing but a gnab gib.\" A what?\" Opposite of a big bang. Come on, let's get zappy.",
            "I begged her, 'Please don't leave me stranded in the middle of some primitive zarking forest with no medical help and a head injury. I could be in serious trouble and so could she.'\" \"What did she say?\" \"She hit me on the head with the rock again,\" Ford responded curtly. \"I think i can confirm that was my daughter.\" \"Sweet kid.\" \"You have to get to know her,\" said Arthur. \"She eases up, does she?\" \"No, but you get a better sense of when to duck.",
            "Dirk was, for one of the few times in a life of exuberantly prolific loquacity, wordless.",
            "How many roads must a man walk down?",
            "No. No games. He wanted her and didn't care who knew it. He definitely and absolutely wanted her, longed for her, wanted to do more things than there were names for with her.",
            "Protect me from knowing what I don't need to know. Protect me from even knowing that there are things to know that I don't know. Protect me from knowing that I decided not to know about the things that I decided not to know about. Amen. Lord, lord, lord. Protect me from the consequences of the above prayer.",
            "It's the story of my life. You see, the quality of any advice anybody has to offer has to be judged against the quality of life they actually lead. Now, as you look through this document you'll see that I've underlined all the major decisions I ever made to make the stand out. They're all indexed and cross-referenced. See? All I can suggest is that if you take decisions that are exactly opposite to the sort of decisions that I've taken, then maybe you won't finish up at the end of your life\" --she paused, and filled her lungs for a good should--\"in a smelly old cave like this!",
            "Just supposing,\" he said, \"just supposing\" --he didn't know what was coming next, so he thought he'd just sit back and listen--\"that there was some extraordinary way in which you were very important to me, and that, though you didn't know it, I was very important to you, but it all went for nothing because we only had five miles and I was a stupid idiot at knowing how to say something very important to someone I've only just met and not crash into lorries a the same time, what would you say...\" He paused, helplessly, and looked at her. \"I should do.",
            "I was created to fulfill a function and I failed in it. I negated my own existence.",
            "I don't want to die now!\" he yelled. \"I've still got a headache! I don't want to go to heaven with a headache, I'd be all cross and wouldn't enjoy it!",
            "Imagine\" he said, \"never even thinking, 'We are alone,' simply because it has never occurred to you to think that there's any other way to be.",
            "The light was only just visible - except of course that there was no one to see, no witnesses, not this time, but it was nevertheless a light.",
            "In the stillness, a fly would not have dared clear it's throat.",
            "Our favourite item was the balcony that overlooked the sea because it had an awning that you lowered by pressing an electric switch. The switch had two settings. You could either turn it to AUTO, in which case the awning lowered itself whenever the sun came out, or you could set it to MANUEL [sic], in which case, we assumed, a small, incompetent Spanish waiter came and did it for you.",
            "Could be. I’m a pretty dangerous dude when I’m cornered.” “Yeah,” said the voice from under the table, “you go to pieces so fast people get hit by the shrapnel.",
            "Deep in the fundamental heart of mind and Universe there is a reason.",
            "Funny, how just when you think life can’t possibly get any worse it suddenly does.",
            "Pardon me for breathing, which I never do any way so I don’t know why I bother to say it, oh God, I’m so depressed.",
            "I watched the gorilla's eyes again, wise and knowing eyes, and wondered about this business of trying to teach apes language. Our language. Why? There are many members of our own species who live in and with the forest and know it and understand it. We don't listen to them. What is there to suggest we would listen to anything an ape could tell us? Or that it would be able to tell us of its life in a language that hasn't been born of that life? I thought, maybe it is not that they have yet to gain a language, it is that we have lost one.",
            "They live in perpetual fear of the time they call \"The Coming of the Great White Handkerchief",
            "What is the point? We assume that every time we do anything we know what the consequences will be, i.e., more or less what we intend them to be. This is not only not always correct. It is wildly, crazily, stupidly, cross-eyed-blithering-insectly wrong!",
            "Who is this god person anyway?",
            "He spent a lot of time flying. He learnt to communicate with birds and discovered that their conversation was fantastically boring. It was all to do with wind speed, wing spans, power-to-weight ratios and a fair bit about berries. Unfortunately, he discovered, once you have learnt birdspeak you quickly come to realize that the air is full of it the whole time, just inane bird chatter. There is no getting away from it.",
            "Despite the fact that an Indonesian island chicken has probably had a much more natural life than one raised on a battery farm in England, people who wouldn't think twice about buying something oven-ready become much more upset about a chicken that they've been on a boat with, so there is probably buried in the Western psyche a deep taboo about eating anything you've been introduced to socially.",
            "Zaphod felt he was teetering on the edge of madness and wondered if he shouldn't just jump over and have done with it.",
            "But nowadays everybody's a comedian, even the weather girls and continuity announcers. We laugh at everything. Not intelligently anymore, not with sudden shock, astonishment, or revelation, just relentlessly and meaninglessly. No more rain showers in the desert, just mud and drizzle everywhere, occasionally illuminated by the flash of paparazzi.",
            "I think we have different value systems.\" —Arthur \"Well mine's better.\" —Ford",
            "The Hitch Hiker's Guide to the Galaxy offers this definition of the word \"Infinite\". Infinite: Bigger than the biggest thing ever and then some. Much bigger than that in fact, really amazingly immense, a totally stunning size, \"wow, that's big\", time. Infinity is just so big that by comparison, bigness itself looks really titchy. Gigantic multiplied by colossal multiplied by staggeringly huge is the sort of concept we're trying to get across here.",
            "To summarize the summary of the summary: people are a problem.",
            "Dirk turned on the car wipers, which grumbled because they didn't have quite enough rain to wipe away, so he turned them off again. Rain quickly speckled the windscreen. He turned on the wipers again, but they still refused to feel that the exercise was worthwhile, and scraped and squeaked in protest.",
            "I like the cover,\" he said. \"Don't Panic. It's the first helpful or intelligible thing anybody's said to me all day.",
            "It's reassuring to realize that everybody is as stupid as you are and that all we are doing when we are standing in the kitchen wondering what we came in here for is \"woking.",
            "...and the Universe, ... will explode later for your pleasure.",
            "R is a velocity of measure, defined as a reasonable speed of travel that is consistent with health, mental well-being, and not being more than, say, five minutes late. It is therefore clearly as almost infinite variable figure according to circumstances, since the first two factors vary not only with speed as an absolute, but also with awareness of the third factor. Unless handled with tranquility, this equation can result in considerable stress, ulcers, and even death.",
            "Stomp stomp. Whirr. Pleased to be of service. Shut up. Thank you. Stomp stomp stomp stomp stomp. Whirr. Thank you for making a simple door very happy. Hope your diodes rot. Thank you. Have a nice day. Stomp stomp stomp stomp. Whirr. It is my pleasure to open for you... Zark off. ...and my satisfaction to close again with the knowledge of a job well done. I said zark off. Thank you for listening to this message.",
            "So this is it,\" said Arthur, \"We are going to die.\" \"Yes,\" said Ford, \"except... no! Wait a minute!\" He suddenly lunged across the chamber at something behind Arthur's line of vision. \"What's this switch?\" he cried. \"What? Where?\" cried Arthur, twisting round. \"No, I was only fooling,\" said Ford, \"we are going to die after all.",
            "The World Wide Web is the only thing I know of whose shortened form takes three times longer to say than what it's short for.",
            "I am rarely happier than when spending an entire day programming my computer...",
            "It's not the fall that kills you; it's the sudden stop at the end.",
            "High on a rocky promontory sat an Electric Monk on a bored horse.",
            "Ford carried on counting quietly. This is about the most aggressive thing you can do to a computer, the equivalent of going up to a human being and saying \"Blood...blood...blood...blood...",
            "But the plans were on display…” “On display? I eventually had to go down to the cellar to find them.” “That’s the display department.” “With a flashlight.” “Ah, well, the lights had probably gone.” “So had the stairs.” “But look, you found the notice, didn’t you?” “Yes,” said Arthur, “yes I did. It was on display in the bottom of a locked filing cabinet stuck in a disused lavatory with a sign on the door saying ‘Beware of the Leopard.",
            "Time affords us the ability to blame past errors on others while whole heartedly pronouncing our futures successes.",
            "Insofar as she recognized at all that she was dreaming, she realized that she must be exploring her subconscious mind. She had heard it said that humans are supposed only to use about a tenth of their brains, and that no one was really clear what the other nine tenths were for, but she had certainly never heard it suggested that they were used for storing penguins.",
            "It is known that there are an infinite number of worlds, simply because there is an infinite amount of space for them to be in. However, not every one of them is inhabited. Therefore, there must be a finite number of inhabited worlds. Any finite number divided by infinity is as near to nothing as makes no odds, so the average population of all the planets in the Universe can be said to be zero. From this it follows that the population of the whole Universe is also zero, and that any people you may meet from time to time are merely the products of a deranged imagination.",
            "What I need... is a strong drink and a peer group.",
            "And for all the richest and most successful merchants life inevitably became rather dull and niggly, and they began to imagine that this was therefore the fault of the worlds they'd settled on.",
            "I don’t know what I’m looking for.” “What not?” “Because … because … I think it might be because if I knew I wouldn’t be able to look for them.",
            "It is most gratifying,\" it said, \"that your enthusiasm for our planet continues unabated, and so we would like to assure you that the guided missiles currently converging with your ship are part of a special service we extend to all of our most enthusiastic clients, and the fully armed nuclear warheads are of course merely a courtesy detail. We look forward to your custom in future lives ... thank you.",
            "That young girl is one of the least benightedly unintelligent organic life forms it has been my profound lack of pleasure not to be able to avoid meeting.",
            "So long, and thanks for all the fish.",
            "The Guide says there is an art to flying\", said Ford, \"or rather a knack. The knack lies in learning how to throw yourself at the ground and miss.",
            "The car shot forward straight into the circle of light, and suddenly Arthur had a fairly clear idea of what infinity looked like. It wasn’t infinity in fact. Infinity itself looks flat and uninteresting. Looking up into the night sky is looking into infinity—distance is incomprehensible and therefore meaningless. The chamber into which the aircar emerged was anything but infinite, it was just very very very big, so big that it gave the impression of infinity far better than infinity itself.",
            "Let the past hold on to itself and let the present move forward into the future.",
            "Well, I mean, yes idealism, yes the dignity of pure research, yes the pursuit of truth in all its forms, but there comes a point I'm afraid where you begin to suspect that the entire multidimensional infinity of the Universe is almost certainly being run by a bunch of maniacs. And if it comes to a choice between spending yet another ten million years finding that out, and on the other hand just taking the money and running, then I for one could do with the exercise.",
            "Just believe everything I tell you, and it will all be very, very simple.' Ah, well, I'm not sure I believe that.",
            "\"Does God know he [exists]?\" \"Of course he does. Otherwise, you could not have asked the question, and I could not have answered.\"",
            "Space is unimaginably big.",
            "The dew has fallen with a particularly sickening thud this morning.",
            "Anything invented before your fifteenth birthday is the order of nature. That's how it should be. Anything invented between your th and th birthday is new and exciting, and you might get a career there. Anything invented after that day, however, is against nature and should be prohibited.",
            "Anything that happens, happens.",
            "Here's what the Encyclopedia Galactica has to say about alcohol. It says that alcohol is a colourless volatile liquid formed by the fermentation of sugars and also notes its intoxicating effect on certain carbon-based life forms.",
            "A theory of the universe that states: If anyone finds out what the universe is for, it will disappear and be replaced by something more bizarrely inexplicable.",
            "How do I know the past is not a fiction conceived to reconcile the difference between my state of mind and the present.",
            "One nonabsolute number is the given time of arrival, which is now known to be one of the most bizarre of mathematical concepts, a number whose existence can only be defined as being anything other than itself. In other words, the given time of arrival is the one moment of time at which it is impossible that any member of the party will arrive.",
            "The books people are writing today, they're too long. You get a little bit of plot, and then pages and pages of Creative Writing. They teach classes in how to do this. They should teach classes in how to stop!",
            "I don't really have any advice, other than to say it's the most appallingly difficult thing I've ever tried to do and I wish I had a better idea of how to do it. In my experience what you end up with is the by-product of your failure to achieve what you set out to do. It may turn out OK, but it wasn't what you meant and you've no idea how you got there.",
            "Democracy is all about not electing the wrong man-eating lizard.",
            "Exactly!\" said Deep Thought. \"So once you do know what the question actually is, you'll know what the answer means.",
            "What to do if you find yourself stuck in a crack in the ground underneath a giant boulder you can't move, with no hope of rescue. Consider how lucky you are that life has been good to you so far. Alternatively, if life hasn't been good to you so far, which given your current circumstances seems more likely, consider how lucky you are that it won't be troubling you much longer.",
            "Even light, which travels so fast it takes most races thousands of years to realize that it travels at all, takes time to journey between the stars.",
            "Technology is the name we give to stuff that doesn't work properly yet",
            "It takes a long time before we really get to grips with this [Darwin's 'On the Origin of Species'] and begin to understand it, because not only does it seem incredible and thoroughly demeaning to us, but it's yet another shock to our system to discover that not only are we not the centre of the Universe and we're not made by anything, but we started out as some kind of slime and got to where we are via being a monkey. It just doesn't read well.",
            "Religion ... has certain ideas at the heart of it which we call sacred or holy or whatever. What it means is, 'Here is an idea or a notion that you're not allowed to say anything bad about; you're just not. Why not? Because you're just not. If someone votes for a party that you don't agree with, you're free to argue about it as much as you like; everybody will have an argument but nobody feels aggrieved by it. ... But on the other hand, if somebody says 'I mustn't move a light switch on a Saturday', you say 'I respect that'.",
            "Capital Letters Were Always The Best Way Of Dealing With Things You Didn't Have A Good Answer To.",
            "I don't say that I don't believe in God because that implies that there is a God for me not to believe in.",
            "I can see we're in for a fabulous evening's apocalypse.",
            "The gorillas are not yet sufficiently advanced in evolutionary terms to have discovered the benefits of passports, currency-declaration forms, and official bribery, and therefore tend to wander backward and forward across the border as and when their beastly, primitive whim takes them.",
            "It was none the less a perfectly ordinary horse, such as convergent evolution has produced in many of the places that life is to be found. They have always understood a great deal more than they let on. It is difficult to be sat on all day, every day, by some other creature, without forming an opinion about them.",
            "Being offended by things is the world's big hobby at the moment. It's almost taken over from wearing goatee beards.",
            "Radio did not kill books and television did not kill radio or movies - what television did kill was cinema newsreel. TV does it much better because it can deliver it instantly. Who wants last week's news?",
            "It can hardly be a coincidence that no language on earth has ever produced the expression \"As pretty as an airport.\" Airports are ugly. Some are very ugly. Some attain a degree of ugliness that can only be the result of a special effort. This ugliness arises because airports are full of people who are tired, cross, and have just discovered that their luggage has landed in Murmansk (Murmansk airport is the only exception of this otherwise infallible rule), and architects have on the whole tried to reflect this in their designs.",
            "I'm 48, which is a bit of a shock to me. Why only last year I thought I was a precocious young thing!",
            "If there was one thing life had taught her it was that there are times when you do not go back for your bag and times when you do. It had yet to teach her to distinguish between the two types of occasion.",
            "I wanted to be John Cleese. It took me some time to realise that the job was taken.",
            "I think that growing up in a crowded continent like Europe with an awful lot of competing claims, ideas, cultures, and systems of thought we have, perforce, developed a more sophisticated notion of what the word freedom means than I see much evidence of in America. To be frank, it sometimes seems that the American idea of freedom has more to do with my freedom to do what I want than your freedom to do what you want. I think that in Europe we're probably better at understanding how to balance those competing claims, though not a lot.",
            "I tend not to read or watch Science Fiction, particularly not comedy Science Fiction. The point is that if it's less good than what I do, there's no point in reading it, if it's better than what I do it makes me depressed",
            "I rarely end up where I was intending to go, but often I end up somewhere I needed to be.",
            "I don't like the idea of missionaries. In fact, the whole business fills me with fear and alarm. I don't believe in God, or at least not in the one we've invented for ourselves in England to fulfill our peculiarly English needs, and certainly not in the ones they've invented in America who supply their servants with toupees, television stations and, most importantly, toll-free telephone numbers. I wish that people who did believe in such things would keep them to themselves and not export them to the developing world.",
            "I didn't notice I was being set upon by a pickpocket, which I am glad of, because I like to work only with professionals.",
            "If I were not an atheist, I think I would have to be a Catholic because if it wasn't the forces of natural selection that designed fish, It must have been an Italian.",
            "We're not obsessed by anything, you see,\" insisted Ford. \"...\" \"And that's the deciding factor. We can't win against obsession. They care, we don't. They win.\" \"I care about lots of things,\" said Slartibartfast, his voice trembling partly with annoyance, but partly also with uncertainty. \"Such as?\" \"Well,\" said the old man, \"life, the Universe. Everything, really. Fjords.\" \"Would you die for them?\" \"Fjords?\" blinked Slartibartfast in surprise. \"No.\" \"Well then.\" \"Wouldn't see the point, to be honest.",
            "So, the world is fine. We don’t have to save the world—the world is big enough to look after itself. What we have to be concerned about, is whether or not the world we live in, will be capable of sustaining us in it. That’s what we need to think about.",
            "The impossible often has a kind of integrity to it which the merely improbable lacks. How often have you been presented with an apparently rational explanation of something that works in all respects other than one, which is just that it is hopelessly improbable? Your instinct is to say, 'Yes, but he or she simply wouldn't do that.",
            "Obviously somebody had been appallingly incompetent and he hoped to God it wasn't him.",
            "You just come along with me and have a good time. The Galaxy's a fun place. You'll need to have this fish in your ear.",
            "After a while he played with the pencil and the paper again and was delighted when he discovered how to make a mark with the one on the other. Various noises continued outside, but he didn't know whether they were real or not. He then talked to his table for a week to see how it would react.",
            "Numbers written on restaurant bills within the confines of restaurants do not follow the same mathematical laws as numbers written on any other pieces of paper in any other parts of the Universe. This single fact took the scientific world by storm.",
            "ABOYNE (vb.) To beat an expert at a game of skill by playing so appallingly that none of his clever tactics or strategies are of any use to him.",
            "The Somebody Else's Problem field is much simpler and more effective, and what's more can be run for over a hundred years on a single torch battery. This is because it relies on people's natural disposition not to see anything they don't want to, weren't expecting, or can't explain.",
            "If they don’t keep exercising their lips, he thought, their brains start working.",
            "...to boldly split infinitives that no man had split before...",
            "What do you get if you multiply six by nine?\" \"Six by nine. Forty two.\" \"That's it. That's all there is.\" \"I always thought something was fundamentally wrong with the universe",
            "Earth: mostly harmless",
            "2,000 years ago one man got nailed to a tree for saying how great it would be if everyone was nice to each other for a change.",
            "Many respectable physicists said that they weren't going to stand for this -- partly because it was a debasement of science, but mostly because they didn't get invited to those sort of parties.",
            "And the most interesting natural structure? A giant, two-thousand-mile-long fish in orbit around Jupiter, according to a reliable report in the Weekly World News. The photograph was very convincing, and I'm only surprised that more-reputable journals like New Scientist, or even just The Sun, haven't followed up with more details. We should be told.",
            "Trillian had come to suspect that the main reason [Zaphood] had had such a wild and successful life was that he never really understood the significance of anything he did.",
            "He turned slowly like a fridge door opening.",
            "A computer chatted to itself in alarm as it noticed an airlock open and close itself for no apparent reason. This was because Reason was in fact out to lunch.",
            "For as long as he could remember, he’d suffered from a vague nagging feeling of being not all there.",
            "But for a moment Dirk had a sense of inifinite loss and sadness that somewhere among the frenzy of information noise that daily rattled the lives of men he thought he might have heard a few notes that denoted the movements of gods.",
            "He would have felt safe if alongside the Dentrassis' underwear, the piles of Sqornshellous mattresses and the man from Betelgeuse holding up a small yellow fish and offering to put it in his ear he had been able to see just a small packet of cornflakes. But he couldn't, and he didn't feel safe.",
            "Zaphod did not want to tangle with them and, deciding that just as discretion is the better part of valor, so was cowardice is the better part of discretion, he valiantly hid himself in a closet.",
            "He had got himself a life. Now he had to find a purpose in it.",
            "Joo Janta 200 Super-Chromatic Peril Sensitive Sunglasses have been specially designed to help people develop a relaxed attitude to danger. At the first hint of trouble, they turn totally black and thus prevent you from seeing anything that might alarm you.",
            "These creatures you call mice, you see, they are not quite as they appear. They are merely the protrusion into our dimension of vastly hyperintelligent pandimensional beings.",
            "In moments of great stress, every life form that exists gives out a tiny subliminal signal.",
            "...and the renewed shock had nearly made him spill his drink. He drained it quickly before anything serious happened to it. He then had another quick one to follow the first one down and check that it was all right.",
            "Ok,\" he said, \"I don't like to disturb you at what I know must be a difficult and distressing time for you, but I need to know first of all if you actually realize that this is a difficult and distressing time for you.",
            "He didn't know why he had become president of the galaxy, except that it seemed a fun thing to be.",
            "If God allows proof that he exists he robs people of faith and without faith what is God? Nothing.",
            "And then, one Thursday, nearly two thousand years after one man had been nailed to a tree for saying how great it would be to be nice to people for a change, a girl sitting on her own in a small café in Rickmansworth suddenly realized what it was that had been going wrong all this time, and she finally knew how the world could be made a good and happy place. This time it was right, it would work, and no one would have to get nailed to anything.",
            "And so the Universe ended.",
            "I have always been absurdly, ridiculously tall. To give you an idea- when we went on school trips to Interesting and Improving Places, the form-master wouldn't say \"Meet under the clock tower,\" or \"Meet under the War Memorial,\" but \"Meet under Adams.",
            "If on the other hand he went to pay his respects to The Door and it wasn't there . . . what then? The answer, of course, was very simple. He had a whole board of circuits for dealing with exactly this problem, in fact this was the very heart of his function. He would continue to believe in it whatever the facts turned out to be, what else was the meaning of Belief? The Door would still be there, even if the Door was not.",
            "I am rarely happier than when spending entire day programming my computer to perform automatically a task that it would otherwise take me a good ten seconds to do by hand.",
            "I love to keep poking and prodding at it. I’ve thought about it so much over the years that that fascination is bound to spill over into my writing.",
            "And wow! Hey! What's this thing coming towards me very fast? Very very fast. So big and flat and round, it needs a big wide sounding word like... ow... ound... round... ground! That's it! That's a good name - ground! I wonder if it will be friends with me?",
            "The Hollywood process is like trying to grill a steak by having a succession of people coming into the room and breathing on it.",
            "Anything invented after you’re thirty-five is against the natural order of things",
            "It's guff. It doesn't advance the action. It makes for nice fat books such as the American market thrives on, but it doesn't actually get you anywhere.",
            "It was one of those pictures that children are supposed to like but don't. Full of endearing little animals doing endearing things, you know?",
            "Grown men, he told himself, in flat contradiction of centuries of accumulated evidence about the way grown men behave, do not behave like this.",
            "How do you feel?\" he asked him. \"Like a military academy,\" said Arthur. \"Bits of me keep on passing out.",
            "What was the self-sacrifice?\" I jettisoned half of a much-loved and I think irreplaceable pair of shoes.\" Why was that self-sacrifice?\" Because they were mine!\" said Ford, crossly. I think we have different value systems.\" Well mine's better.",
            "Would you like to see the menu?\" he said, \"or would you like meet the Dish of the Day?\" ... “Good evening,” it lowed and sat back heavily on its haunches, “I am the main Dish of the Day. May I interest you in parts of my body?",
            "One day old Thrashbarg said that Almighty Bob had declared that he, Thrashbarg, was to have first pick of the sandwiches. The villagers asked him when this had happened, exactly, and Thrashbarg said it had happened yesterday, when they weren't looking. 'Have faith,' Old Thrashbarg said, 'or burn!' They let him have first pick of the sandwiches. It seemed easiest.",
            "All through my life I've had this strange unaccountable feeling that something was going on in the world, something big, even sinister, and no one would tell me what it was.\" \"No,\" said the old man, \"that's just perfectly normal paranoia. Everyone in the Universe has that.",
            "He almost danced to the fridge, found the three least hairy things in it, put them on a plate and watched them intently for two minutes. Since they made no attempt to move within that time he called them breakfast and ate them. Between them they killed a virulent space disease he'd picked up without knowing it in the Flargathon Gas Swamps a few days earlier, which otherwise would have killed off half the population of the Western Hemisphere, blinded the other half, and driven everyone else psychotic and sterile, so the Earth was lucky there.",
            "The future of computer power is pure simplicity.",
            "In fact there was only one species on the planet more intelligent than dolphins, and they spent a lot of their time in behavioural research laboratories running around inside wheels and conduction frighteningly elegant and subtle experiments on man. The fact that once again man completely misinterpreted this relationship was entirely according to these creatures’ plans.",
            "The system of life on this planet is so astoundingly complex that it was a long time before man even realized that it was a system at all and that it wasn't something that was just there.",
            "See first, think later, then test. But always see first. Otherwise you will only see what you were expecting. Most scientists forget that.",
            "When the girl sitting at the next table looked away from a moment, Dirk leaned over and took her coffee. He knew that he was perfectly safe doing this because she would simply not be able to believe that this had happened.",
            "Lord, lord, lord. Protect me from the consequences of the above prayer.",
            "The invention of the scientific method and science is, I'm sure we'll all agree, the most powerful intellectual idea, the most powerful framework for thinking and investigating and understanding and challenging the world around us that there is, and it rests on the premise that any idea is there to be attacked. If it withstands the attack then it lives to fight another day and if it doesn't withstand the attack then down it goes. Religion doesn't seem to work like that.",
            "We are stuck with technology when all we really want is just stuff that works. How do you recognize something that is still technology? A good clue is if it comes with a manual.",
            "People will then often say, 'But surely it's better to remain an Agnostic just in case?' This, to me, suggests such a level of silliness and muddle that I usually edge out of the conversation rather than get sucked into it. (If it turns out that I've been wrong all along, and there is in fact a god, and if it further turned out that this kind of legalistic, cross-your-fingers-behind-your-back, Clintonian hair-splitting impressed him, then I think I would choose not to worship him anyway.)",
            "The longest and most destructive party ever held is now into its fourth generation and still no one shows any signs of leaving. The problem of when the drink is going to run out is, however, going to have to be faced one day. The planet over which they are floating is no longer the planet it was when they first started floating over it. It is in bad shape",
            "The Presidents job, is not to wield power himself, but to lead attention away from it.",
            "If somebody votes for a party that you don't agree with, you're free to argue about it as much as you like. ... But on the other hand, if somebody says, 'I mustn't move a light switch on a Saturday,' you say, 'Fine, I respect that.'",
            "For millions of years, on average, one species became extinct every century.... We are now heaving more than a thousand different species of animals and plants off the planet every year.",
            "He shifted his weight from foot to foot, but it was equally uncomfortable on each.",
            "Many men of course became extremely rich, but this was perfectly natural and nothing to be ashamed of because no one was really poor, at least no one worth speaking of.",
            "For a moment he felt good about this. A moment or two later he felt bad about feeling good about it. Then he felt good about feeling bad about feeling good about it and satisfied, drove on into the night.",
            "Time, we know, is relative. You can travel light years through the stars and back, and if you do it at the speed of light then, when you return, you may have aged mere seconds while your twin brother or sister will have aged twenty, thirty, forty or however many years it is, depending on how far you traveled. This will come to you as a profound shock, particularly if you didn't know you had a twin brother or sister.",
            "I think the idea of art kills creativity.",
            "The party and the Krikkit warship looked, in their writhings, a little like two ducks, one of which is trying to make a third duck inside the second duck, whilst the second duck is trying very hard to explain that it doesn't feel ready for a third duck right now, is uncertain that it would want any putative third duck anyway, and certainly not whilst it, the second duck, was busy flying.",
            "But while nature has considerable resilience, there is a limit to how far that resilience can be stretched. No one knows how close to the limit we are getting. The darker it gets, the faster we're driving",
            "Yes. They are the words that finally turned me into the hermit I have now become. It was quite sudden. I saw them, and I knew what I had to do.\" The sign read: \"Hold stick near center of its length. Moisten pointed end in mouth. Insert in tooth space, blunt end next to gum. Use gentle in-out motion.\" \"It seemed to me,\" said Wonko the Sane, \"that any civilization that had so far lost its head as to need to include a set of detailed instructions for use in a package of toothpicks, was no longer a civilization in which I could live and stay sane.",
            "Plenty of people did not care for him much, but then there is a huge difference between disliking somebody - maybe even disliking them a lot - and actually shooting them, strangling them, dragging them through the fields and setting their house on fire.",
            "There are some oddities in the perspective with which we see the world.",
            "I tend to get very suspicious of anything that thinks it's art while it's being created.",
            "If I want to read something that's really giving me something serious and fundamental to think about, about the human condition, if you like, or what we're all doing here, or what's going on, then I'd rather read something by a scientist in the life sciences, like Richard Dawkins, for instance.",
            "There's nothing worse than sitting down to write a novel and saying, \"Well, okay, I'm going to do something of high artistic worth.\" It's funny.",
            "You turn the computer into the storyteller and the player into the audience, like in the old days when the storyteller would actually respond to the audience, rather than just having the audience respond to the storyteller. I had an enormous amount of fun, actually, working on that.",
            "Being literate as a writer is good craft, is knowing your job, is knowing how to use your tools properly and not to damage the tools as you use them."
          ],
          "cardinality_distribution": {
            "type": "uniform",
            "min": 0,
            "max": 620
          }
        },
        {
          "type": "enum",
          "name": "errorlevel",
          "values": [
            "DEBUG",
            "INFO",
            "WARNING",
            "ERROR",
            "FATAL"
          ],  
          "cardinality_distribution": {
            "type": "exponential",
            "mean": 2
          }
        },
        {
          "type": "int",
          "name": "advance_steps",
          "distribution": {
            "type": "uniform",
            "min": 0,
            "max": 1000
          },
          "cardinality": 10,
          "cardinality_distribution": {
            "type": "normal",
            "mean": 5,
            "stddev": 2
          }
        },
        {
          "type": "float",
          "name": "hashlevel",
          "distribution": {
            "type": "uniform",
            "min": 0,
            "max": 100
          },
          "cardinality": 10,
          "cardinality_distribution": {
            "type": "exponential",
            "mean": 5
          },
          "precision": 3
        },
        {
          "type": "timestamp",
          "name": "dim_timestamp",
          "distribution": {
            "type": "uniform",
            "min": "2008-09-03T10:00:00.0Z",
            "max": "2008-09-03T20:00:00.0Z"
          },
          "cardinality": 0
        },
        {
          "type": "ipaddress",
          "name": "client_ip",
          "distribution": {
            "type": "uniform",
            "min": 2130706433,
            "max": 2130706440
          },
          "cardinality": 0
        }
      ]
    }
  ],
  "interarrival": {
    "type": "constant",
    "value": 1
  },
  "states": [
    {
      "name": "state_1",
      "emitter": "example_record_1",
      "delay": {
        "type": "constant",
        "value": 1
      },
      "transitions": [
        {
          "next": "state_1",
          "probability": 1
        }
      ]
    }
  ]
}
